# Задача 2.2. 

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например: 
# месяц 2 (февраль) является частью первого квартала; 
# месяц 6 (июнь) является частью второго квартала; 
# месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
    dct = {
        'январь' : 'первый квартал',
        'февраль' : 'первый квартал',
        'март' : 'первый квартал',
        'апрель' : 'второй квартал',
        'май' : 'второй квартал',
        'июнь' : 'второй квартал',
        'июль' : 'третий квартал',
        'август' : 'третий квартал',
        'сентябрь' : 'третий квартал',
        'октябрь' : 'четвертый квартал',
        'ноябрь' : 'четвертый квартал',
        'декабрь' : 'четвертый квартал',
        '1' : 'первый квартал',
        '2' : 'первый квартал',
        '3' : 'первый квартал',
        '4' : 'второй квартал',
        '5' : 'второй квартал',
        '6' : 'второй квартал',
        '7' : 'третий квартал',
        '8' : 'третий квартал',
        '9' : 'третий квартал',
        '10' : 'четвертый квартал',
        '11' : 'четвертый квартал',
        '12' : 'четвертый квартал',
    }
    return (dct[month])

print(quarter_of(input('Введите месяц ')))